In [2]:
import pandas as pd

In [3]:
k = pd.DataFrame({'c1':[2,1,3,0,0]})

In [4]:
m = pd.DataFrame({'c1':[1, 2], 'c2':[0, 1], 'c3':[-1,-2]})
# m = pd.DataFrame({'c2':[1, 1, 2, 2], 'c3':[0, 1, 2, 3]})

In [75]:
kk = pd.merge(k, m, on='c1', how='left')
kk

   c1   c2   c3
0   2  1.0 -2.0
1   1  0.0 -1.0
2   3  NaN  NaN
3   0  NaN  NaN
4   0  NaN  NaN

In [74]:
t = pd.DataFrame({'c4':[3, 3, 3, 2, 2], 'c5':[6, 7, 8, 5, 6]})
t

   c4  c5
0   3   6
1   3   7
2   3   8
3   2   5
4   2   6

In [77]:
tt = pd.concat([kk, t], axis=1)
tt

   c1   c2   c3  c4  c5
0   2  1.0 -2.0   3   6
1   1  0.0 -1.0   3   7
2   3  NaN  NaN   3   8
3   0  NaN  NaN   2   5
4   0  NaN  NaN   2   6

In [78]:
del tt['c2']

In [79]:
tt

   c1   c3  c4  c5
0   2 -2.0   3   6
1   1 -1.0   3   7
2   3  NaN   3   8
3   0  NaN   2   5
4   0  NaN   2   6